Управление_гостиницами_EDT/src/InformationRegisters/СтатусыНомеров/СтатусыНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыНомеров</name>
  <comment>Заполняется статус брони номера по дням</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <comment>Статус номера (свободен, занят, забронирован)</comment>
    <type>
      <types>EnumRef.СтатусыНомеров</types>
    </type>
  </resources>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_гостиницами_EDT/src/CommonModules/ДанныеПоНомерам/Module.bsl
Функция НомерСвободен(Номер,НачалоПериода,ОкончаниеПериода) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыНомеров.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыНомеров КАК СтатусыНомеров
		|ГДЕ
		|	СтатусыНомеров.Номер = &Номер
		|	И СтатусыНомеров.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();


КонецФункции // НомерСвободен()
